# EvaluatedParameter Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EvaluatedParameter Class
Members See Also
---
Hold the evaluated ParameterValue and Definition of a parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class EvaluatedParameter : IDisposable
```

Visual Basic
---
```text
Public Class EvaluatedParameter _
	Implements IDisposable
```

Visual C++
---
```text
public ref class EvaluatedParameter : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..EvaluatedParameter
# See Also
EvaluatedParameter Members
Autodesk.Revit.DB Namespace